In [4]:
import numpy as np
import pandas as pd

In [6]:
d = { 'A':[1,2,np.nan], 'B': [5, np.nan, np.nan], 'C': [1,2,3]}

In [7]:
d['A'][0]

1

In [9]:
df = pd.DataFrame(d)

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.dropna() #drop any rows that has a null value in it

     A    B  C
0  1.0  5.0  1

In [12]:
df.dropna(axis=1)
#drops any column that has a null value in it

   C
0  1
1  2
2  3

In [13]:
df.dropna(thresh=2) #specifying the number of nan values a row/column should have in order to get dropped

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
df.fillna(value='Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [16]:
df.fillna(value='Fill Value', thresh=2)

TypeError: DataFrame.fillna() got an unexpected keyword argument 'thresh'

In [17]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64